# 데이터 프레임의 데이터 조작

In [68]:
import numpy as np
import pandas as pd

### -데이터 갯수 세기

In [4]:
s = pd.Series(range(10))
s[3] = np.nan
s
#NaN은 정수가 아니라 실수!!!!

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [5]:
s.count()
#NaN은 갯수에 포함 안됨

9

In [7]:
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  4.0  1.0  0.0  4.0
1  3.0  0.0  4.0  1.0
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0

In [8]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [11]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [12]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### -카테고리 값 세기

In [13]:
titanic.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

In [17]:
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

### - 정렬

In [20]:
df

     0    1    2    3
0  4.0  1.0  0.0  4.0
1  3.0  0.0  4.0  1.0
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0

In [21]:
df[0].sort_values()

2    1.0
3    2.0
1    3.0
0    4.0
Name: 0, dtype: float64

In [22]:
df[0].sort_values(ascending=False)

0    4.0
1    3.0
3    2.0
2    1.0
Name: 0, dtype: float64

In [23]:
df[3].sort_values()

1    1.0
3    1.0
0    4.0
2    NaN
Name: 3, dtype: float64

In [24]:
df.sort_values(by = 0)

     0    1    2    3
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0
1  3.0  0.0  4.0  1.0
0  4.0  1.0  0.0  4.0

In [25]:
titanic.embarked.value_counts()
#value값으로 정렬했으니까 숫자 많은 순서대로

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [26]:
titanic.embarked.value_counts().sort_index()
# 인덱스로 정렬했으니까 알파벳순서대로

C    168
Q     77
S    644
Name: embarked, dtype: int64

### - 행/열 합계

In [27]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [28]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [38]:
df2['RowSum'] = df2.sum(axis = 1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7     280
1  6  9  2  4  5  2  4  2     272
2  4  7  7  9  1  7  0  6     328
3  9  9  7  6  9  1  0  1     336

In [31]:
df2.sum()

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

In [42]:
df2.mean()

0           6.00
1           8.25
2           6.25
3           6.00
4           3.75
5           2.50
6           1.25
7           4.00
RowSum    304.00
dtype: float64

In [43]:
df2.std()

0          2.160247
1          0.957427
2          2.986079
3          2.160247
4          4.112988
5          3.109126
6          1.892969
7          2.943920
RowSum    32.659863
dtype: float64

In [45]:
df2.describe()

,0,1,2,3,4,5,6,7,RowSum
count,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.00000,4.000000
mean,6.000000,8.250000,6.250000,6.000000,3.750000,2.500000,1.250000,4.00000,304.000000
std,2.160247,0.957427,2.986079,2.160247,4.112988,3.109126,1.892969,2.94392,32.659863
min,4.000000,7.000000,2.000000,4.000000,0.000000,0.000000,0.000000,1.00000,272.000000
25%,4.750000,7.750000,5.750000,4.750000,0.750000,0.750000,0.000000,1.75000,278.000000
50%,5.500000,8.500000,7.000000,5.500000,3.000000,1.500000,0.500000,4.00000,304.000000
75%,6.750000,9.000000,7.500000,6.750000,6.000000,3.250000,1.750000,6.25000,330.000000
max,9.000000,9.000000,9.000000,9.000000,9.000000,7.000000,4.000000,7.00000,336.000000

### -apply변환

In [46]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [47]:
df3.apply(lambda x: x.max()-x.min())
#각 열의 최대값과 최소값의 차이 구하기

A    3
B    2
C    4
dtype: int64

In [48]:
df3.apply(lambda x: x.max()-x.min(),axis=1)
#행에 대해 적용하고 싶으면 axis=1 인수를 쓴다.

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [50]:
titanic['adult/child']=titanic.apply(
    lambda r: 'adult' if r.age >= 20 else 'child', axis =1
)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

### -fillna 매서드

In [52]:
titanic.deck.value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [57]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [58]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### -astype 메서드

In [60]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

### -실수 값을 카테고리 값으로 변환

In [61]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [62]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [63]:
cats[8] #20은 미성년자임. 경계에 걸리면 앞의 값

'미성년자'

In [64]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [65]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [66]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

['Q2', 'Q1', 'Q2', 'Q3', 'Q1', ..., 'Q1', 'Q1', 'Q4', 'Q4', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [67]:
pd.value_counts(cats)

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64